ams/src/Documents/_ВозвратИзПереработки/_ВозвратИзПереработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>_ВозвратИзПереработки</name>
  <basedOn>Document.ПриобретениеТоваровУслуг</basedOn>
  <registerRecords>AccumulationRegister._ТоварыПереданные</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ams/src/Documents/_ВозвратИзПереработки/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Партнер.СписокВыбора.ЗагрузитьЗначения(мср.ПолучитьМассивПартнеровДавальческих());
	Элементы.ТоварыНоменклатура.СписокВыбора.ЗагрузитьЗначения(мср.ПолучитьМатериалыВПереработку());
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
	Контрагент = AMS_ВызовСервера.ПолучитьКонтрагентаПартнёра(Объект.Партнер);
	Если Не Контрагент = Неопределено Тогда
		Объект.Контрагент = Контрагент;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подбор(Команда)
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Поле ""Контрагент"" не заполнено", Объект.Ссылка,
			"Объект.Контрагент");
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Объект.Склад) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Поле ""Склад"" не заполнено", Объект.Ссылка, "Объект.Склад");
		Возврат;
	КонецЕсли;

	АдресВХранилищеДляПодбора = ПолучитьАдресВХранилище();
	Если АдресВХранилищеДляПодбора = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Парам = Новый Структура("АдресВХранилище", АдресВХранилищеДляПодбора);

	ОткрытьФорму("Документ._ВозвратИзПереработки.Форма.Подбор", Парам, ЭтотОбъект, , , ,
		Новый ОписаниеОповещения("ОткрытьФормуПодборЗавершение", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры
&НаКлиенте
Процедура ДвижениеДокумента(Команда)
	СсылкаНаОбъект = Объект.Ссылка;
	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ВидимостьКомандВариантовОтчетов", Ложь);
		ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
		ПараметрыФормы.Вставить("ПараметрКоманды", СсылкаНаОбъект);

		ОткрытьФорму("Отчет.ДвиженияДокумента.Форма", ПараметрыФормы, ЭтотОбъект, Истина);
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура СвязанныеДокументы(Команда)
	МенюОтчетыУТКлиент.СтруктураПодчиненности(Объект.Ссылка, Неопределено);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьФормуПодборЗавершение(Результат, ДополнительныеПераметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Модифицированность = Истина;

	Объект.Товары.Очистить();

	Для Каждого Стр Из Результат Цикл
		НовСтр = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресВХранилище()
	Попытка
		ЗаблокироватьДанныеФормыДляРедактирования();

		Модифицированность = Истина;

		Док = РеквизитФормыВЗначение("Объект");

		Данные = Новый Структура;
		Данные.Вставить("Товары", Док.Товары.Выгрузить( , "Номенклатура,Количество"));
		Данные.Вставить("Контрагент", Док.Контрагент);
		Данные.Вставить("Склад", Док.Склад);
		Данные.Вставить("Дата", Док.Дата - 1);

		Возврат ПоместитьВоВременноеХранилище(Данные);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
КонецФункции

#КонецОбласти
